[{"word":"a","desc":"INTERJ ah! ha! oh! ooh! aw! (emotion word)"},{"word":"akesi","desc":"N non-cute animal, reptile, amphibian, dinosaur, monster"},{"word":"ala","desc":"MOD no, not, none, un-; N nothingness, negation, zero; INTERJ no!"},{"word":"ali (ale)","desc":"N everything, anything, life, the universe; MOD all, every, complete, whole"},{"word":"anpa","desc":"N bottom, down, under, below, floor, beneath; MOD low, lower, bottom; VT lower, down, defeat, overcome"},{"word":"ante","desc":"N difference; MOD different; CONT otherwise, or else; VT change, alter, modify"},{"word":"anu","desc":"CONJ or"},{"word":"awen","desc":"VI stay, wait, remain; VT keep; MOD remaining, stationary, permanent, sedentary"},{"word":"e","desc":"SEP (introduces a direct object)"},{"word":"en","desc":"CONJ and (used to coordinate head nouns)"},{"word":"ijo","desc":"N thing, something, stuff, anything, object; MOD of something; VT objectify"},{"word":"ike","desc":"MOD bad, evil, wrong, evil, overly complex, (figuratively) unhealthy; INTERJ oh dear! woe! alas!; N negativity, evil, badness; VT to make bad, to worsen, to have a negative effect upon; VI to be bad, to suck"},{"word":"ilo","desc":"N tool, device, machine, thing used for a specific purpose"},{"word":"insa","desc":"N inside, inner world, centre, stomach; MOD internal, central"},{"word":"jaki","desc":"MOD dirty, gross, filthy; N dirt, pollution, filth; VT pollute, dirty; INTERJ ew! yuck!"},{"word":"jan","desc":"N person, people, human, being, somebody, anybody; MOD personal, human, somebody's, of people; VT personify, humanize, personalize"},{"word":"jelo","desc":"MOD yellow, light green"},{"word":"jo","desc":"VT have, contain; N having; KAMA receive, get, take, obtain"},{"word":"kala","desc":"N fish, sea creature"},{"word":"kalama","desc":"N sound, noise, voice; VI make noise; VT sound, ring, play (an instrument)"},{"word":"kama","desc":"N event, happening, chance, arrival, beginning; MOD coming, future; VI come, become, arrive, happen, pursue actions to arrive to (a certain state), manage to, start to; VT bring about, summon"},{"word":"kasi","desc":"N plant, leaf, herb, tree, wood"},{"word":"ken","desc":"N possibility, ability, power to do things, permission; VI can, is able to, is allowed to, may, is possible; VT make possible, enable, allow, permit; CONT it is possible that"},{"word":"kepeken","desc":"VT use; PREP with"},{"word":"kili","desc":"N fruit, pulpy vegetable, mushroom"},{"word":"kin","desc":"MOD also, too, even, indeed (emphasizes the word that follows)"},{"word":"kiwen","desc":"N hard thing, rock, stone, metal, mineral, clay; MOD hard, solid, stone-like, made of stone or metal"},{"word":"ko","desc":"MOD air-like, ethereal, gaseous"},{"word":"kon","desc":"N air, wind, odour, soul; MOD air-like, ethereal, gaseous"},{"word":"kule","desc":"N color, paint; VT color, paint; MOD colourful"},{"word":"kulupu","desc":"N group, community, society, company; MOD communal, shared, public, of the society"},{"word":"kute","desc":"VT listen, hear; MOD auditory, hearing"},{"word":"la","desc":"SEP (between adverb or phrase of context and sentence)"},{"word":"lape","desc":"N, VI sleep, rest; MOD sleeping, of sleep laso mod blue, blue-green"},{"word":"laso","desc":"MOD blue, blue-green"},{"word":"lawa","desc":"N head, mind; MOD main, leading, in charge; VT lead, control, rule, steer"},{"word":"len","desc":"N clothing, cloth, fabric"},{"word":"lete","desc":"N cold; MOD cold, uncooked; VT cool down, chill, freeze"},{"word":"li","desc":"SEP (between any subject except mi and sina and its verb; also used to introduce a new verb for the same subject)"},{"word":"lili","desc":"MOD small, little, young, a bit, short, fes, less; VT reduce, shorten, shrink, lessen"},{"word":"linja","desc":"N long, very thin, floppy thing, e.g. string, rope, hair, thread, cord, chain"},{"word":"lipu","desc":"N flat and bendable thing, e.g. paper, card, ticket"},{"word":"loje","desc":"MOD red"},{"word":"lon","desc":"PREP be located in/at/on; VI be there, be present, be real/true, exist, be awake"},{"word":"luka","desc":"N hand, arm; MOD five"},{"word":"lukin","desc":"VT see, look at, watch, read; VI look, watch out, pay attention; MOD visual"},{"word":"lupa","desc":"N hole, orifice, window, door"},{"word":"ma","desc":"N land, earth, country, (outdoor) area"},{"word":"mama","desc":"N parent, mother, father; MOD of the parent, parental, maternal, fatherly"},{"word":"mani","desc":"N money, material wealth, currency, dollar, capital"},{"word":"meli","desc":"N woman, female, girl, wife, girlfriend; MOD female, feminine, womanly"},{"word":"mi","desc":"N I, we; MOD my, our"},{"word":"mije","desc":"N man, male, husband, boyfriend; MOD male, masculine, manly"},{"word":"moku","desc":"N food, meal; VT eat, drink, swallow, ingest, consume"},{"word":"moli","desc":"N death; MOD dead, deadly, fatal; VT kill; VI die, be dead"},{"word":"monsi","desc":"N back, rear end, butt, behind; MOD back, rear"},{"word":"mu","desc":"INTERJ woof! meow! moo! etc. (cute animal noise)"},{"word":"mun","desc":"N moon; MOD lunar"},{"word":"musi","desc":"N fun, playing, game, recreation, art, entertainment; MOD artful, fun, recreational; VI play, have fun; VT amuse, entertain"},{"word":"mute","desc":"MOD many, several, very, much, a lot, abundant, numerous, more; N amount, quantity; VT make many or much"},{"word":"nanpa","desc":"N number; OTH -th (ordinal numbers)"},{"word":"nasa","desc":"MOD silly, crazy, foolish, drunk, strange, stupid, weird; VT drive crazy, make weird"},{"word":"nasin","desc":"N way, manner, custom, road, path, doctrine, system, method"},{"word":"nena","desc":"N bump, hill, mountain, button, nose"},{"word":"ni","desc":"MOD this, that"},{"word":"nimi","desc":"N word, name"},{"word":"noka","desc":"N leg, foot"},{"word":"o","desc":"SEP O (vocative or imperative); INTERJ hey! (calling somebody's attention)"},{"word":"oko","desc":"N eye"},{"word":"olin","desc":"N love; MOD love; VT to love (a person)"},{"word":"ona","desc":"N he, she, it, they; MOD his, her, its, their"},{"word":"open","desc":"VT open, turn on"},{"word":"pakala","desc":"N blunder, accident, mistake, destruction, damage, breaking; VT screw up, fuck up, botch, ruin, break, hurt, injure, damage, bungle, spoil, ruin; VI screw up, fall apart, break; INTERJ damn! fuck!"},{"word":"pali","desc":"N activity, work, deed, projec; MOD active, work-related, operating, working; VT do, make, build, create; VI act, work, function"},{"word":"palisa","desc":"N long, mostly hard object, e.g. rod, stick, branch"},{"word":"pana","desc":"VT give, put, send, place, release, emit, cause; N giving, transfer, exchange"},{"word":"pi","desc":"SEP of, belonging to"},{"word":"pilin","desc":"N feelings, emotion, heart; VI feel; VT feel, think, sense, touch"},{"word":"pimeja","desc":"MOD black, dark; N darkness, shadows; VT darken"},{"word":"pini","desc":"N end, tip; MOD completed, finished, past, done, ago; VT finish, close, end, turn off"},{"word":"pipi","desc":"N bug, insect, spider"},{"word":"poka","desc":"N side, hip, next to; MOD neighboring; PREP in the accompaniment of, with"},{"word":"poki","desc":"N container, box, bowl, cup, glass"},{"word":"pona","desc":"N good, simplicity, positivity; MOD good, simple, positive, nice, correct, right; INTERJ great! good! thanks! OK! cool! yay!; VT improve, fix, repair, make good"},{"word":"sama","desc":"MOD same, similar, equal, of equal status or position; PREP like, as, seem; CONT similarly, in the same way that"},{"word":"seli","desc":"N fire, warmth, heat; MOD hot, warm, cooked; VT heat, warm up, cook"},{"word":"selo","desc":"N outside, surface, skin, shell, bark, shape, peel"},{"word":"seme","desc":"OTH what, which, wh- (question word)"},{"word":"sewi","desc":"N high, up, above, top, over, on; MOD superior, elevated, religious, formal"},{"word":"sijelo","desc":"N body, physical state"},{"word":"sike","desc":"N circle, wheel, sphere, ball, cycle; MOD round, cyclical"},{"word":"sin","desc":"MOD new, fresh, another, more; VT renew, renovate, freshen"},{"word":"sina","desc":"N you; MOD your"},{"word":"sinpin","desc":"N front, chest, torso, wall"},{"word":"sitelen","desc":"N picture, image; VT draw, write"},{"word":"sona","desc":"N knowledge, wisdom, intelligence, understanding; VT know, understand, know how to; VI know, understand; KAMA learn, study"},{"word":"soweli","desc":"N animal, especially land mammal, lovable animal"},{"word":"suli","desc":"MOD big, tall, long, adult, important; VT enlarge, lengthen; N size"},{"word":"suno","desc":"N sun, light"},{"word":"supa","desc":"N horizontal surface, e.g furniture, table, chair, pillow, floor"},{"word":"suwi","desc":"N candy, sweet food; MOD sweet, cute; VT sweeten"},{"word":"tan","desc":"PREP from, by, because of, since; N origin, cause"},{"word":"taso","desc":"MOD only, sole; CONJ but"},{"word":"tawa","desc":"PREP to, in order to, towards, for, until; N movement, transportation; MOD moving, mobile; VI go, leave, walk, travel, move; VT move, displace"},{"word":"telo","desc":"N water, liquid, juice, sauce; VT water, wash with water"},{"word":"tenpo","desc":"N time, period of time, moment, duration, situation"},{"word":"toki","desc":"N language, talking, speech, communication; VT say; VI talk, chat, communicate; INTERJ hello! hi!"},{"word":"tomo","desc":"N indoor constructed space, e.g. house, home, room, building; MOD urban, domestic, household"},{"word":"tu","desc":"MOD two; N duo, pair; VT double, separate/cut/divide in two"},{"word":"unpa","desc":"N sex, sexuality; MOD erotic, sexual; VT have sex with, sleep with, fuck; VI have sex"},{"word":"uta","desc":"N mouth; MOD oral"},{"word":"utala","desc":"N conflict, disharmony, competition, fight, war, battle, attack, blow, argument, physical or verbal violence; VT hit, strike, attack, compete against"},{"word":"walo","desc":"MOD white, light (colour); N white thing/part, whiteness, lightness"},{"word":"wan","desc":"MOD one, a; N unit, element, particle, part, piece; VT unite, make one"},{"word":"waso","desc":"N bird, winged animal"},{"word":"wawa","desc":"N energy, strength, power; MOD energetic, strong, fierce, intense, sure, confident; VT strengthen, energize, empower"},{"word":"weka","desc":"MOD away, absent, missing; N absence; VT throw away, remove, get rid of"},{"word":"wile","desc":"VT to want, need, wish, have to, must, will, should; N desire, need, will; MOD necessary"}]
